#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
data.template_file.cloud_init: Reading...
data.template_file.cloud_init: Read complete after 0s [id=518d3a8659770fca05891fd6087f2465f40b4751d66090536e4d9857bf04b7e4]
data.template_file.user_data: Reading...
data.template_file.user_data: Read complete after 0s [id=1ef8e20b627f16b858bec1ffc90b7175baf6be804649bf4fda84d7a2e85eb2ca]
data.template_cloudinit_config.user_data: Reading...
data.template_cloudinit_config.user_data: Read complete after 0s [id=1346389820]
data.aws_caller_identity.current: Reading...
module.ec2_api_service.data.aws_iam_policy_document.this_assume_role: Reading...
module.ec2_calculator_service.data.aws_iam_policy_document.this_assume_role: Reading...
aws_s3_bucket.scripts: Refreshing state... [id=test-scripts-bucket-xhcy]
module.vpc.aws_eip.nat: Refreshing state... [id=eipalloc-094cab60aef0903e5]
module.ec2_math_service.data.aws_iam_policy_document.this_assume_role: Reading...
aws_ecr_repository.services: Refreshing state... [id=test-service-ecr]
module.vpc.aws_vpc.this: Refreshing state... [id=vpc-0c73dbe40ea87750d]
module.ec2_nats_service.data.aws_iam_policy_document.this_assume_role: Reading...
data.aws_region.current: Reading...
module.ec2_api_service.data.aws_iam_policy_document.this_assume_role: Read complete after 0s [id=1903849331]
module.ec2_math_service.data.aws_iam_policy_document.this_assume_role: Read complete after 0s [id=1903849331]
data.aws_region.current: Read complete after 0s [id=ap-southeast-1]
module.ec2_api_service.aws_iam_role.this: Refreshing state... [id=test-api-service-role]
module.ec2_nats_service.data.aws_iam_policy_document.this_assume_role: Read complete after 0s [id=1903849331]
module.ec2_nats_service.aws_iam_role.this: Refreshing state... [id=test-nats-service-role]
module.ec2_calculator_service.data.aws_iam_policy_document.this_assume_role: Read complete after 0s [id=1903849331]
module.ec2_math_service.aws_iam_role.this: Refreshing state... [id=test-math-service-role]
module.ec2_calculator_service.aws_iam_role.this: Refreshing state... [id=test-calculator-service-role]
data.aws_caller_identity.current: Read complete after 0s [id=955746675523]
module.ec2_math_service.aws_iam_instance_profile.this: Refreshing state... [id=test-math-service-profile]
module.ec2_api_service.aws_iam_instance_profile.this: Refreshing state... [id=test-api-service-profile]
module.ec2_nats_service.aws_iam_instance_profile.this: Refreshing state... [id=test-nats-service-profile]
module.ec2_calculator_service.aws_iam_instance_profile.this: Refreshing state... [id=test-calculator-service-profile]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0a3a790c6a101878a]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-023258a70b4ee1dfe]
module.vpc.aws_internet_gateway.this: Refreshing state... [id=igw-05eef14c47462aacc]
aws_security_group.alb: Refreshing state... [id=sg-0e15f3494d5f284d9]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-063cd84df58f0a7cf]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-0c40a91d41558fb89]
module.vpc.aws_route_table.private: Refreshing state... [id=rtb-0a49b312ac97b8378]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0089974f1ab1ecd33]
aws_lb_target_group.ec2_api_service: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-1:955746675523:targetgroup/test-api-service-tg/9a1e4ea95a154c44]
module.ec2_api_service.aws_security_group.this: Refreshing state... [id=sg-02ef0cb83fc65120e]
module.ec2_math_service.aws_security_group.this: Refreshing state... [id=sg-0cd3b1349ef53991b]
module.ec2_nats_service.aws_security_group.this: Refreshing state... [id=sg-0afe2f2e5bdac2779]
module.ec2_calculator_service.aws_security_group.this: Refreshing state... [id=sg-04cfab8f8095d1e68]
aws_security_group_rule.alb_ingress_https: Refreshing state... [id=sgrule-3353634580]
aws_security_group_rule.alb_ingress: Refreshing state... [id=sgrule-1187814955]
module.ec2_math_service.aws_security_group_rule.egress["allow_to_all"]: Refreshing state... [id=sgrule-1427775919]
module.vpc.aws_route.public_internet_gateway: Refreshing state... [id=r-rtb-0c40a91d41558fb891080289494]
module.vpc.aws_nat_gateway.this: Refreshing state... [id=nat-0903d2a17cf5fd0bd]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0f516d925e00098e4]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-030d7ef89909fcb05]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0a42a96945621d549]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0e8dbc266c9e5c932]
module.ec2_api_service.aws_security_group_rule.ingress["allow_from_https"]: Refreshing state... [id=sgrule-1539870380]
module.ec2_api_service.aws_security_group_rule.egress["allow_to_all"]: Refreshing state... [id=sgrule-4227132091]
module.ec2_nats_service.aws_security_group_rule.egress["allow_to_all"]: Refreshing state... [id=sgrule-3257684970]
module.ec2_calculator_service.aws_security_group_rule.egress["allow_to_all"]: Refreshing state... [id=sgrule-3289685051]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-1:955746675523:loadbalancer/app/test-alb/656e0c06319ca41b]
module.vpc.aws_route.private: Refreshing state... [id=r-rtb-0a49b312ac97b83781080289494]
aws_security_group_rule.alb_egress: Refreshing state... [id=sgrule-1042729509]
module.ec2_nats_service.aws_instance.this: Refreshing state... [id=i-06875b90cc4355451]
module.ec2_math_service.aws_instance.this: Refreshing state... [id=i-07876466f816a676c]
module.ec2_calculator_service.aws_instance.this: Refreshing state... [id=i-067222514365fb132]
module.ec2_api_service.aws_instance.this: Refreshing state... [id=i-07c09f39e8a8d7e08]
aws_s3_bucket_acl.scripts: Refreshing state... [id=test-scripts-bucket-xhcy,private]
aws_s3_object.script_nats: Refreshing state... [id=scripts/deploy-nats.sh]
module.ec2_nats_service.aws_security_group_rule.ingress["allow_from_calculator"]: Refreshing state... [id=sgrule-2857923659]
module.ec2_nats_service.aws_security_group_rule.ingress["allow_from_math"]: Refreshing state... [id=sgrule-137509963]
module.ec2_nats_service.aws_security_group_rule.ingress["allow_from_api"]: Refreshing state... [id=sgrule-4288993160]
aws_lb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-1:955746675523:listener/app/test-alb/656e0c06319ca41b/c2de448f3f0c4bfc]
aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-1:955746675523:listener/app/test-alb/656e0c06319ca41b/085db943cf6ef8f7]
aws_lb_listener_rule.api: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-1:955746675523:listener-rule/app/test-alb/656e0c06319ca41b/c2de448f3f0c4bfc/361fb090b55d3b30]
aws_ssm_parameter.service: Refreshing state... [id=/test/services]
aws_lb_target_group_attachment.ec2_api_service: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-1:955746675523:targetgroup/test-api-service-tg/9a1e4ea95a154c44-20230310100020756500000006]
aws_s3_object.script_service: Refreshing state... [id=scripts/deploy-service.sh]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.deploy_service will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "deploy_service" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            #!/bin/bash
            while getopts i:s:e: flag
            do
                case "${flag}" in
                    i) image=${OPTARG};;
                    s) service=${OPTARG};;
                    e) env_file=${OPTARG};;
                esac
            done
            aws --region=${aws_region} ssm get-parameter --name ${ssm_parameter_name} --output text --query Parameter.Value > $env_file
            aws ecr get-login-password --region ${aws_region} | docker login --username AWS --password-stdin ${aws_account_id}.dkr.ecr.${aws_region}.amazonaws.com
            docker pull $image
            docker stop $service
            docker rm $service
            if [[ $service == "api" ]]
            then
              docker run --name $service \
                --env-file $env_file \
                -e SERVICES=$service \
                -e PORT=3000 \
                -p 3000:3000 \
                --restart=unless-stopped \
                -d $image
            else
              docker run --name $service \
                --env-file $env_file \
                -e SERVICES=$service \
                --restart=unless-stopped \
                -d $image
            fi
            while ! docker logs $service | grep -q "started successfully.";
            do
                sleep 1
                echo "working..."
            done
        EOT
      + vars     = {
          + "aws_account_id" = "955746675523"
          + "aws_region"     = "ap-southeast-1"
        }
    }

  # aws_s3_object.script_service will be updated in-place
  ~ resource "aws_s3_object" "script_service" {
      ~ etag                   = "152f41c6ded4a3862d4d4fc65820d6c2" -> (known after apply)
        id                     = "scripts/deploy-service.sh"
      ~ source                 = "./scripts/deploy-service.sh" -> (known after apply)
        tags                   = {}
      + version_id             = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_ssm_parameter.service must be replaced
-/+ resource "aws_ssm_parameter" "service" {
      ~ arn            = "arn:aws:ssm:ap-southeast-1:955746675523:parameter/test/services" -> (known after apply)
      ~ data_type      = "text" -> (known after apply)
      ~ id             = "/test/services" -> (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      ~ name           = "/test/services" -> "test-services" # forces replacement
      - tags           = {} -> null
      ~ tags_all       = {} -> (known after apply)
      ~ tier           = "Standard" -> (known after apply)
      ~ version        = 1 -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @artpasut, Action: `pull_request`*